<script setup>
import AuthenticatedLayout from "@/Layouts/AuthenticatedLayout.vue";
import InputError from "@/Components/InputError.vue";
import InputLabel from "@/Components/InputLabel.vue";
import PrimaryButton from "@/Components/PrimaryButton.vue";
import TextInput from "@/Components/TextInput.vue";
import { Head, Link, useForm } from "@inertiajs/vue3";
import VueMultiselect from "vue-multiselect";
import { ref, onMounted, computed, watch } from "vue";
import Swal from "sweetalert2"; // 👉 นำเข้า SweetAlert2
import EditScholar from "@/Pages/Admin/Users/EditScholar.vue";
import moment from 'moment';
const props = defineProps({
  user: {
    type: Object,
    required: true,
  },
  roles: Array,
});
const selectedProvince = ref(null);
const selectedDistrict = ref(null);
 props.user.birthday ? moment(props.user.birthday).format('DD-MM-YYYY') : ''

const userData = ref({
  ...props.user,
});
console.debug(userData.value.birthday);
const formattedBirthday = ref(userData.value.birthday);


const form = useForm({
  name: userData.value.name || "",
  email: userData.value.email || "",
  id_card: userData.value.id_card || "",
  phone: userData.value.phone || "",
  birthday: userData.value.birthday ? userData.value.birthday : formattedBirthday || '',
  title: userData.value.title || "",
  fname: userData.value.fname || "",
  lname: userData.value.lname || "",
  zip_code: userData.value.zip_code || "",
  student_code: userData.value.student_code || "",
  institution: userData.value.institution || "",
  branch: userData.value.branch || "",
  faculty: userData.value.faculty || "",
  sub_district: userData.value.sub_district || "",
  district: userData.value.district || "",
  province: userData.value.province || "",
});  

const provinces = [
  
  { code: "10", name: "กรุงเทพมหานคร" },
  { code: "71", name: "กาญจนบุรี" },
  { code: "46", name: "กาฬสินธุ์" },
  { code: "62", name: "กำแพงเพชร" },
  { code: "40", name: "ขอนแก่น" },
  { code: "22", name: "จันทบุรี" },
  { code: "24", name: "ฉะเชิงเทรา" },
  { code: "18", name: "ชัยนาท" },
  { code: "36", name: "ชัยภูมิ" },
  { code: "86", name: "ชุมพร" },
  { code: "20", name: "ชลบุรี" },
  { code: "50", name: "เชียงใหม่" },
  { code: "57", name: "เชียงราย" },
  { code: "92", name: "ตรัง" },
  { code: "23", name: "ตราด" },
  { code: "64", name: "ตาก" },
  { code: "26", name: "นครนายก" },
  { code: "73", name: "นครปฐม" },
  { code: "48", name: "นครพนม" },
  { code: "30", name: "นครราชสีมา" },
  { code: "80", name: "นครศรีธรรมราช" },
  { code: "60", name: "นครสวรรค์" },
  { code: "12", name: "นนทบุรี" },
  { code: "96", name: "นราธิวาส" },
  { code: "55", name: "น่าน" },
  { code: "38", name: "บึงกาฬ" },
  { code: "31", name: "บุรีรัมย์" },
  { code: "77", name: "ประจวบคีรีขันธ์" },
  { code: "25", name: "ปราจีนบุรี" },
  { code: "94", name: "ปัตตานี" },
  { code: "14", name: "พระนครศรีอยุธยา" },
  { code: "82", name: "พังงา" },
  { code: "93", name: "พัทลุง" },
  { code: "66", name: "พิจิตร" },
  { code: "65", name: "พิษณุโลก" },
  { code: "76", name: "เพชรบุรี" },
  { code: "67", name: "เพชรบูรณ์" },
  { code: "54", name: "แพร่" },
  { code: "56", name: "พะเยา" },
  { code: "83", name: "ภูเก็ต" },
  { code: "44", name: "มหาสารคาม" },
  { code: "49", name: "มุกดาหาร" },
  { code: "58", name: "แม่ฮ่องสอน" },
  { code: "95", name: "ยะลา" },
  { code: "35", name: "ยโสธร" },
  { code: "45", name: "ร้อยเอ็ด" },
  { code: "85", name: "ระนอง" },
  { code: "21", name: "ระยอง" },
  { code: "70", name: "ราชบุรี" },
  { code: "16", name: "ลพบุรี" },
  { code: "52", name: "ลำปาง" },
  { code: "51", name: "ลำพูน" },
  { code: "42", name: "เลย" },
  { code: "33", name: "ศรีสะเกษ" },
  { code: "47", name: "สกลนคร" },
  { code: "90", name: "สงขลา" },
  { code: "74", name: "สมุทรสาคร" },
  { code: "11", name: "สมุทรปราการ" },
  { code: "75", name: "สมุทรสงคราม" },
  { code: "27", name: "สระแก้ว" },
  { code: "19", name: "สระบุรี" },
  { code: "17", name: "สิงห์บุรี" },
  { code: "65", name: "สุโขทัย" },
  { code: "72", name: "สุพรรณบุรี" },
  { code: "84", name: "สุราษฎร์ธานี" },
  { code: "32", name: "สุรินทร์" },
  { code: "43", name: "หนองคาย" },
  { code: "39", name: "หนองบัวลำภู" },
  { code: "15", name: "อ่างทอง" },
  { code: "41", name: "อุดรธานี" },
  { code: "61", name: "อุทัยธานี" },
  { code: "34", name: "อุบลราชธานี" },
  { code: "37", name: "อำนาจเจริญ" },
];

const districts = {
  37: [
    { code: "3701", name: "เมืองอำนาจเจริญ" },
    { code: "3702", name: "ชานุมาน" },
    { code: "3703", name: "ปทุมราชวงศา" },
    { code: "3704", name: "พนา" },
    { code: "3705", name: "ลืออำนาจ" },
    { code: "3706", name: "เสนางคนิคม" },
    { code: "3707", name: "หัวตะพาน" }
  ],
  61: [
    { code: "6101", name: "เมืองอุทัยธานี" },
    { code: "6102", name: "ห้วยคต" },
    { code: "6103", name: "ทัพทัน" },
    { code: "6104", name: "หนองฉาง" },
    { code: "6105", name: "ลานสัก" },
    { code: "6106", name: "ทุ่งลูกนก" },
    { code: "6107", name: "สว่างอารมณ์" },
    { code: "6108", name: "บ้านไร่" },
    { code: "6109", name: "หนองขาหย่าง" }
  ],
  15: [
    { code: "1501", name: "เมืองอ่างทอง" },
    { code: "1502", name: "ไชโย" },
    { code: "1503", name: "ป่าโมก" },
    { code: "1504", name: "โพธิ์ทอง" },
    { code: "1505", name: "แสวงหา" },
    { code: "1506", name: "วิเศษชัยชาญ" },
    { code: "1507", name: "สามโก้" }
  ],
  39: [
    { code: "3901", name: "เมืองหนองบัวลำภู" },
    { code: "3902", name: "นากลาง" },
    { code: "3903", name: "นาวัง" },
    { code: "3904", name: "โนนสัง" },
    { code: "3905", name: "ศรีบุญเรือง" },
    { code: "3906", name: "สุวรรณคูหา" }
  ],
  43: [
    { code: "4301", name: "เมืองหนองคาย"},
    { code: "4302", name: "ท่าบ่อ"},
    { code: "4303", name: "โพธิ์ตาก"},
    { code: "4304", name: "โพนพิสัย"},
    { code: "4305", name: "ศรีเชียงใหม่" },
    { code: "4306", name: "สังคม"},
    { code: "4307", name: "สระใคร"}
  ],
  72: [
    { code: "7201", name: "เมืองสุพรรณบุรี" },
    { code: "7202", name: "ดอนเจดีย์" },
    { code: "7203", name: "ด่านช้าง" },
    { code: "7204", name: "เดิมบางนางบวช" },
    { code: "7205", name: "บางปลาม้า" },
    { code: "7206", name: "ศรีประจันต์" },
    { code: "7207", name: "สองพี่น้อง" },
    { code: "7208", name: "สามชุก" },
    { code: "7209", name: "หนองหญ้าไซ" },
    { code: "7210", name: "อู่ทอง" }
  ],
  17: [
    { code: "1701", name: "เมืองสิงห์บุรี" },
    { code: "1702", name: "บางระจัน" },
    { code: "1703", name: "ค่ายบางระจัน" },
    { code: "1704", name: "พรหมบุรี" },
    { code: "1705", name: "ท่าช้าง" },
    { code: "1706", name: "อินทร์บุรี" }
  ],
  75: [
    { code: "7501", name: "เมืองสมุทรสงคราม" },
    { code: "7502", name: "อัมพวา" },
    { code: "7503", name: "บางคนที" }
  ],
  60: [
    { code: "6001", name: "เมืองนครสวรรค์" },
    { code: "6002", name: "พยุหะคีรี" },
    { code: "6003", name: "ชุมแสง" },
    { code: "6004", name: "ตาคลี" },
    { code: "6005", name: "ลาดยาว" },
    { code: "6006", name: "โกรกพระ" },
    { code: "6007", name: "แม่เปิน" },
    { code: "6008", name: "แม่วงก์" },
    { code: "6009", name: "ชุมตาบง" },
    { code: "6010", name: "ท่าตะโก" },
    { code: "6011", name: "บรรพตพิสัย" },
    { code: "6012", name: "พยุหะคีรี" },
    { code: "6013", name: "เมืองนครสวรรค์" },
    { code: "6014", name: "หนองบัว" },
    { code: "6015", name: "เก้าเลี้ยว" },
    { code: "6016", name: "ตากฟ้า" },
    { code: "6017", name: "ไพศาลี" }
  ],
  16: [
    { code: "1601", name: "เมืองลพบุรี" },
    { code: "1602", name: "โคกสำโรง" },
    { code: "1603", name: "ชัยบาดาล" },
    { code: "1604", name: "ท่าวุ้ง" },
    { code: "1605", name: "บ้านหมี่" },
    { code: "1606", name: "พัฒนานิคม" },
    { code: "1607", name: "ท่าหลวง" },
    { code: "1608", name: "สระโบสถ์" },
    { code: "1609", name: "โคกเจริญ" },
    { code: "1610", name: "ลำสนธิ" },
    { code: "1611", name: "หนองม่วง" }
  ],
  70: [
    { code: "7001", name: "เมืองราชบุรี" },
    { code: "7002", name: "จอมบึง" },
    { code: "7003", name: "สวนผึ้ง" },
    { code: "7004", name: "ดำเนินสะดวก" },
    { code: "7005", name: "บ้านโป่ง" },
    { code: "7006", name: "บางแพ" },
    { code: "7007", name: "โพธาราม" },
    { code: "7008", name: "ปากท่อ" },
    { code: "7009", name: "วัดเพลง" },
    { code: "7010", name: "บ้านคา" }
  ],
  58: [
    { code: "5801", name: "เมืองแม่ฮ่องสอน" },
    { code: "5802", name: "ขุนยวม" },
    { code: "5803", name: "ปางมะผ้า" },
    { code: "5804", name: "แม่สะเรียง" },
    { code: "5805", name: "สบเมย" },
    { code: "5806", name: "แม่ลาน้อย" },
    { code: "5807", name: "เมืองแม่สะเรียง" }
  ],
   49: [
    { code: "4901", name: "เมืองมุกดาหาร" },
    { code: "4902", name: "ดอนตาล" },
    { code: "4903", name: "คำชะอี" },
    { code: "4904", name: "หนองสูง" },
    { code: "4905", name: "คำบ่อ" },
    { code: "4906", name: "หนองแสง" },
    { code: "4907", name: "ศรีบุญเรือง" }
  ],
  67: [
    { code: "6701", name: "เมืองเพชรบูรณ์" },
    { code: "6702", name: "หล่มสัก" },
    { code: "6703", name: "หล่มเก่า" },
    { code: "6704", name: "วิเชียรบุรี" },
    { code: "6705", name: "บึงสามพัน" },
    { code: "6706", name: "นครหลวง" },
    { code: "6707", name: "เขาค้อ" },
    { code: "6708", name: "ชนแดน" },
    { code: "6709", name: "ซับใหญ่" },
    { code: "6710", name: "หนองไผ่" },
    { code: "6711", name: "วังโป่ง" }
  ],
  76: [
    { code: "7601", name: "เมืองเพชรบุรี" },
    { code: "7602", name: "เขาย้อย" },
    { code: "7603", name: "ชะอำ" },
    { code: "7604", name: "ท่ายาง" },
    { code: "7605", name: "บ้านลาด" },
    { code: "7606", name: "บ้านแหลม" },
    { code: "7607", name: "หนองหญ้าปล้อง" },
    { code: "7608", name: "แก่งกระจาน" }
  ],
  25: [
    { code: "2501", name: "เมืองปราจีนบุรี" },
    { code: "2502", name: "ประจันตคาม" },
    { code: "2503", name: "ศรีมหาโพธิ" },
    { code: "2504", name: "ศรีมโหสถ" },
    { code: "2505", name: "บ้านสร้าง" },
    { code: "2506", name: "กบินทร์บุรี" },
    { code: "2507", name: "นาดี" }
  ],
  31: [
    { code: "3101", name: "เมืองบุรีรัมย์" },
    { code: "3102", name: "คูเมือง" },
    { code: "3103", name: "หนองกี่" },
    { code: "3104", name: "ลำปลายมาศ" },
    { code: "3105", name: "สตึก" },
    { code: "3106", name: "ประโคนชัย" },
    { code: "3107", name: "พลับพลาชัย" },
    { code: "3108", name: "นางรอง" },
    { code: "3109", name: "ชำนิ" },
    { code: "3110", name: "แคนดง" },
    { code: "3111", name: "บ้านกรวด" },
    { code: "3112", name: "พุทไธสง" },
    { code: "3113", name: "บุรีรัมย์" },
    { code: "3114", name: "ห้วยราช" },
    { code: "3115", name: "หนองสรวง" },
    { code: "3116", name: "ลำปลายมาศ" },
    { code: "3117", name: "กงลับ" },
    { code: "3118", name: "โนนดินแดง" }
  ], 
  48: [
    { code: "4801", name: "ท่าอุเทน" },
    { code: "4802", name: "นาแก" },
    { code: "4803", name: "นาทม" },
    { code: "4804", name: "นาหว้า" },
    { code: "4805", name: "ธาตุพนม" },
    { code: "4806", name: "บ้านแพง" },
    { code: "4807", name: "ปลาปาก" },
    { code: "4808", name: "โพนสวรรค์" },
    { code: "4809", name: "เมืองนครพนม" },
    { code: "4810", name: "เรณูนคร" },
    { code: "4811", name: "วังยาง" },
    { code: "4812", name: "ศรีสงคราม" }
  ],
  36: [ // ชัยภูมิ
    { code: "3601", name: "อำเภอเมืองชัยภูมิ" },
    { code: "3602", name: "อำเภอแก้งคร้อ" },
    { code: "3603", name: "อำเภอชื่อที่ 3 (โปรดปรับปรุง)" },
    { code: "3604", name: "อำเภอชื่อที่ 4 (โปรดปรับปรุง)" },
    { code: "3605", name: "อำเภอชื่อที่ 5 (โปรดปรับปรุง)" },
    { code: "3606", name: "อำเภอชื่อที่ 6 (โปรดปรับปรุง)" },
    { code: "3607", name: "อำเภอชื่อที่ 7 (โปรดปรับปรุง)" },
    { code: "3608", name: "อำเภอชื่อที่ 8 (โปรดปรับปรุง)" },
    { code: "3609", name: "อำเภอชื่อที่ 9 (โปรดปรับปรุง)" },
    { code: "3610", name: "อำเภอชื่อที่ 10 (โปรดปรับปรุง)" },
    { code: "3611", name: "อำเภอชื่อที่ 11 (โปรดปรับปรุง)" },
    { code: "3612", name: "อำเภอชื่อที่ 12 (โปรดปรับปรุง)" },
    { code: "3613", name: "อำเภอชื่อที่ 13 (โปรดปรับปรุง)" },
    { code: "3614", name: "อำเภอชื่อที่ 14 (โปรดปรับปรุง)" },
    { code: "3615", name: "อำเภอชื่อที่ 15 (โปรดปรับปรุง)" },
    { code: "3616", name: "อำเภอชื่อที่ 16 (โปรดปรับปรุง)" }
  ],
  26: [ // นครนายก
    { code: "2601", name: "อำเภอเมืองนครนายก" },
    { code: "2602", name: "อำเภอบ้านม่วง" },
    { code: "2603", name: "อำเภอองครักษ์" },
    { code: "2604", name: "อำเภอพลับพลาชัย" }
  ],
  66: [
    { code: "6601", name: "เมืองพิจิตร" },
    { code: "6602", name: "ตะพานหิน" },
    { code: "6603", name: "บางมูลนาก" },
    { code: "6604", name: "โพธิ์ประทับช้าง" },
    { code: "6605", name: "โพทะเล" },
    { code: "6606", name: "สามง่าม" },
    { code: "6607", name: "วังทรายพูน" },
    { code: "6608", name: "ทับคล้อ" },
    { code: "6609", name: "สากเหล็ก" },
    { code: "6610", name: "ดงเจริญ" },
    { code: "6611", name: "บึงนาง" }
  ],
  71: [ // กาญจนบุรี
    { code: "7101", name: "อำเภอเมืองกาญจนบุรี" },
    { code: "7102", name: "อำเภอไทรโยค" },
    { code: "7103", name: "อำเภอท่ามะกา" },
    { code: "7104", name: "อำเภอเลาขวัญ" },
    { code: "7105", name: "อำเภอศรีสวัสดิ์" },
    { code: "7106", name: "อำเภอพนมทวน" },
    { code: "7107", name: "อำเภอท่าม่วง" },
    { code: "7108", name: "อำเภอบ่อพลอย" },
    { code: "7109", name: "อำเภอด่านมะขามเตี้ย" },
    { code: "7110", name: "อำเภอสังขละบุรี" },
    { code: "7111", name: "อำเภอทองผาภูมิ" },
    { code: "7112", name: "อำเภอหนองปรือ" },
    { code: "7113", name: "อำเภอห้วยกระเจา" }
  ],
  73: [ // นครปฐม
    { code: "7301", name: "อำเภอเมืองนครปฐม" },
    { code: "7302", name: "อำเภอนครชัยศรี" },
    { code: "7303", name: "อำเภอสามพราน" },
    { code: "7304", name: "อำเภอดอนตูม" },
    { code: "7305", name: "อำเภอบางเลน" },
    { code: "7306", name: "อำเภอกำแพงแสน" },
    { code: "7307", name: "อำเภอพุทธมณฑล" }
  ],
  18: [
    { code: "1801", name: "อำเภอเมืองชัยนาท" },
    { code: "1802", name: "อำเภอมโนรมย์" },
    { code: "1803", name: "อำเภอวัดสิงห์" },
    { code: "1804", name: "อำเภอสรรพยา" },
    { code: "1805", name: "อำเภอสรรคบุรี" },
    { code: "1806", name: "อำเภอหันคา" },
    { code: "1807", name: "อำเภอหนองมะโมง" },
    { code: "1808", name: "อำเภอเนินขาม" }
  ],
  46: [
    { code: "4601", name: "อำเภอเมืองกาฬสินธุ์" },
    { code: "4602", name: "อำเภอกมลาไสย" },
    { code: "4603", name: "อำเภอกุฉินารายณ์" },
    { code: "4604", name: "อำเภอเขาวง" },
    { code: "4605", name: "อำเภอคำม่วง" },
    { code: "4606", name: "อำเภอฆ้องชัย" },
    { code: "4607", name: "อำเภอดอนจาน" },
    { code: "4608", name: "อำเภอท่าคันโท" },
    { code: "4609", name: "อำเภอนาคู" },
    { code: "4610", name: "อำเภอนามน" },
    { code: "4611", name: "อำเภอยางตลาด" },
    { code: "4612", name: "อำเภอร่องคำ" },
    { code: "4613", name: "อำเภอสมเด็จ" },
    { code: "4614", name: "อำเภอสหัสขันธ์" },
    { code: "4615", name: "อำเภอสามชัย" },
    { code: "4616", name: "อำเภอหนองกุงศรี" },
    { code: "4617", name: "อำเภอห้วยผึ้ง" },
    { code: "4618", name: "อำเภอห้วยเม็ก" }
  ],
  "10": [ // กรุงเทพมหานคร (50 เขต)
    { code: "1001", name: "เขตพระนคร" },
    { code: "1002", name: "เขตดุสิต" },
    { code: "1003", name: "เขตหนองจอก" },
    { code: "1004", name: "เขตบางรัก" },
    { code: "1005", name: "เขตบางเขน" },
    { code: "1006", name: "เขตบางกะปิ" },
    { code: "1007", name: "เขตปทุมวัน" },
    { code: "1008", name: "เขตป้อมปราบศัตรูพ่าย" },
    { code: "1009", name: "เขตพระโขนง" },
    { code: "1010", name: "เขตมีนบุรี" },
    { code: "1011", name: "เขตลาดกระบัง" },
    { code: "1012", name: "เขตยานนาวา" },
    { code: "1013", name: "เขตสัมพันธวงศ์" },
    { code: "1014", name: "เขตพญาไท" },
    { code: "1015", name: "เขตธนบุรี" },
    { code: "1016", name: "เขตบางกอกใหญ่" },
    { code: "1017", name: "เขตห้วยขวาง" },
    { code: "1018", name: "เขตคลองสาน" },
    { code: "1019", name: "เขตตลิ่งชัน" },
    { code: "1020", name: "เขตบางกอกน้อย" },
    { code: "1021", name: "เขตบางขุนเทียน" },
    { code: "1022", name: "เขตภาษีเจริญ" },
    { code: "1023", name: "เขตหนองแขม" },
    { code: "1024", name: "เขตราษฎร์บูรณะ" },
    { code: "1025", name: "เขตบางพลัด" },
    { code: "1026", name: "เขตดินแดง" },
    { code: "1027", name: "เขตบึงกุ่ม" },
    { code: "1028", name: "เขตสาทร" },
    { code: "1029", name: "เขตบางซื่อ" },
    { code: "1030", name: "เขตจตุจักร" },
    { code: "1031", name: "เขตบางคอแหลม" },
    { code: "1032", name: "เขตประเวศ" },
    { code: "1033", name: "เขตคลองเตย" },
    { code: "1034", name: "เขตสวนหลวง" },
    { code: "1035", name: "เขตจอมทอง" },
    { code: "1036", name: "เขตดอนเมือง" },
    { code: "1037", name: "เขตราชเทวี" },
    { code: "1038", name: "เขตลาดพร้าว" },
    { code: "1039", name: "เขตวัฒนา" },
    { code: "1040", name: "เขตบางแค" },
    { code: "1041", name: "เขตหลักสี่" },
    { code: "1042", name: "เขตสายไหม" },
    { code: "1043", name: "เขตคันนายาว" },
    { code: "1044", name: "เขตสะพานสูง" },
    { code: "1045", name: "เขตวังทองหลาง" },
    { code: "1046", name: "เขตคลองสามวา" },
    { code: "1047", name: "เขตบางนา" },
    { code: "1048", name: "เขตทวีวัฒนา" },
    { code: "1049", name: "เขตทุ่งครุ" },
    { code: "1050", name: "เขตบางบอน" }
  ],
  38: [
    { code: "3801", name: "เมืองบึงกาฬ" },
    { code: "3802", name: "เซกา" },
    { code: "3803", name: "พรเจริญ" },
    { code: "3804", name: "บุ่งคล้า" },
    { code: "3805", name: "บึงโขงหลง" },
    { code: "3806", name: "โซ่พิสัย" },
    { code: "3807", name: "ศรีวิชัย" },
    { code: "3808", name: "พานพร้าว" }
  ],
  "50": [ // เชียงใหม่ (25 อำเภอ)
    { code: "5001", name: "อำเภอเมืองเชียงใหม่" },
    { code: "5002", name: "อำเภอจอมทอง" },
    { code: "5003", name: "อำเภอแม่แจ่ม" },
    { code: "5004", name: "อำเภอเชียงดาว" },
    { code: "5005", name: "อำเภอดอยสะเก็ด" },
    { code: "5006", name: "อำเภอแม่แตง" },
    { code: "5007", name: "อำเภอแม่ริม" },
    { code: "5008", name: "อำเภอสะเมิง" },
    { code: "5009", name: "อำเภอฝาง" },
    { code: "5010", name: "อำเภอแม่อาย" },
    { code: "5011", name: "อำเภอพร้าว" },
    { code: "5012", name: "อำเภอสันป่าตอง" },
    { code: "5013", name: "อำเภอสันกำแพง" },
    { code: "5014", name: "อำเภอสันทราย" },
    { code: "5015", name: "อำเภอหางดง" },
    { code: "5016", name: "อำเภอฮอด" },
    { code: "5017", name: "อำเภอดอยเต่า" },
    { code: "5018", name: "อำเภออมก๋อย" },
    { code: "5019", name: "อำเภอสารภี" },
    { code: "5020", name: "อำเภอเวียงแหง" },
    { code: "5021", name: "อำเภอไชยปราการ" },
    { code: "5022", name: "อำเภอแม่วาง" },
    { code: "5023", name: "อำเภอแม่ออน" },
    { code: "5024", name: "อำเภอดอยหล่อ" },
    { code: "5025", name: "อำเภอกัลยาณิวัฒนา" }
  ], 
  40: [
    // ขอนแก่น
    { code: "4001", name: "เมืองขอนแก่น" },
    { code: "4002", name: "บ้านฝาง" },
    { code: "4003", name: "พระยืน" },
    { code: "4004", name: "หนองเรือ" },
    { code: "4005", name: "ชุมแพ" },
    { code: "4006", name: "สีชมพู" },
    { code: "4007", name: "น้ำพอง" },
    { code: "4008", name: "อุบลรัตน์" },
    { code: "4009", name: "กระนวน" },
    { code: "4010", name: "บ้านไผ่" },
    { code: "4011", name: "เปือยน้อย" },
    { code: "4012", name: "พล" },
    { code: "4013", name: "แวงใหญ่" },
    { code: "4014", name: "แวงน้อย" },
    { code: "4015", name: "หนองสองห้อง" },
    { code: "4016", name: "ภูเวียง" },
    { code: "4017", name: "มัญจาคีรี" },
    { code: "4018", name: "ชนบท" },
    { code: "4019", name: "เขาสวนกวาง" },
    { code: "4020", name: "ภูผาม่าน" },
    { code: "4021", name: "ซำสูง" },
    { code: "4022", name: "โคกโพธิ์ไชย" },
    { code: "4023", name: "หนองนาคำ" },
    { code: "4024", name: "บ้านแฮด" },
    { code: "4025", name: "โนนศิลา" },
  ], 
  11: [
    { code: "1101", name: "เมืองสมุทรปราการ" },
    { code: "1102", name: "บางบ่อ" },
    { code: "1103", name: "บางพลี" },
    { code: "1104", name: "พระประแดง" },
    { code: "1105", name: "พระสมุทรเจดีย์" },
    { code: "1106", name: "บางเสาธง" }
  ],
  12: [
    { code: "1201", name: "เมืองนนทบุรี" },
    { code: "1202", name: "ปากเกร็ด" },
    { code: "1203", name: "บางบัวทอง" },
    { code: "1204", name: "บางใหญ่" },
    { code: "1205", name: "บางกรวย" },
    { code: "1206", name: "ไทรน้อย" }
  ],
  14: [
    { code: "1401", name: "พระนครศรีอยุธยา" },
    { code: "1402", name: "ท่าเรือ" },
    { code: "1403", name: "นครหลวง" },
    { code: "1404", name: "บางไทร" },
    { code: "1405", name: "บางบาล" },
    { code: "1406", name: "ภาชี" },
    { code: "1407", name: "อุทัย" },
    { code: "1408", name: "บางปะอิน" },
    { code: "1409", name: "บางปะหัน" },
    { code: "1410", name: "บ้านแพรก" },
    { code: "1411", name: "มหาราช" },
    { code: "1412", name: "เสนา" },
    { code: "1413", name: "วังน้อย" },
    { code: "1414", name: "ลาดบัวหลวง" },
    { code: "1415", name: "บางซ้าย" }
  ],
  19: [
    { code: "1901", name: "เมืองสระบุรี" },
    { code: "1902", name: "แก่งคอย" },
    { code: "1903", name: "หนองแค" },
    { code: "1904", name: "วิหารแดง" },
    { code: "1905", name: "เสาไห้" },
    { code: "1906", name: "หนองแซง" },
    { code: "1907", name: "มวกเหล็ก" },
    { code: "1908", name: "วังม่วง" },
    { code: "1909", name: "พระพุทธบาท" },
    { code: "1910", name: "เฉลิมพระเกียรติ" },
    { code: "1911", name: "บ้านหมอ" },
    { code: "1912", name: "หนองโดน" },
    { code: "1913", name: "ดอนพุด" }
  ],
  57: [
    { code: "5701", name: "เมืองเชียงราย" },
    { code: "5702", name: "แม่จัน" },
    { code: "5703", name: "แม่สาย" },
    { code: "5704", name: "ท่าตะโก" },
    { code: "5705", name: "เชียงของ" },
    { code: "5706", name: "เทิง" },
    { code: "5707", name: "พาน" },
    { code: "5708", name: "เชียงแสน" },
    { code: "5709", name: "แม่สรวย" },
    { code: "5710", name: "เวียงป่าเป้า" },
    { code: "5711", name: "ป่าแดด" },
    { code: "5712", name: "เวียงชัย" },
    { code: "5713", name: "พญาเม็งราย" },
    { code: "5714", name: "เวียงแก่น" },
    { code: "5715", name: "แม่ฟ้าหลวง" },
    { code: "5716", name: "ขุนตาล" },
    { code: "5717", name: "แม่ลาว" }
  ],
  52: [
    { code: "5201", name: "เมืองลำปาง" },
    { code: "5202", name: "แม่ทะ" },
    { code: "5203", name: "เกาะคา" },
    { code: "5204", name: "แจ้ห่ม" },
    { code: "5205", name: "แม่เมาะ" },
    { code: "5206", name: "เสริมงาม" },
    { code: "5207", name: "งาว" },
    { code: "5208", name: "วังเหนือ" },
    { code: "5209", name: "เถิน" },
    { code: "5210", name: "แม่พริก" },
    { code: "5211", name: "สบปราบ" },
    { code: "5212", name: "ห้างฉัตร" },
    { code: "5213", name: "เมืองปาน" }
  ],
  51: [
    { code: "5101", name: "เมืองลำพูน" },
    { code: "5102", name: "บ้านโฮ่ง" },
    { code: "5103", name: "ทุ่งเสา" },
    { code: "5104", name: "ลี้" },
    { code: "5105", name: "ป่าซาง" },
    { code: "5106", name: "ดอกคำใต้" },
    { code: "5107", name: "เวียงหนองล่อง" },
    { code: "5108", name: "แม่ทา" }
  ],
  54: [
    { code: "5401", name: "เมืองแพร่" },
    { code: "5402", name: "สูงเม่น" },
    { code: "5403", name: "ร้องกวาง" },
    { code: "5404", name: "ลอง" },
    { code: "5405", name: "เด่นชัย" },
    { code: "5406", name: "หนองม่วง" }
  ],
  62: [
    { code: "6201", name: "เมืองพะเยา" },
    { code: "6202", name: "จุน" },
    { code: "6203", name: "เชียงคำ" },
    { code: "6204", name: "ภูซาง" },
    { code: "6205", name: "ดอกคำใต้" },
    { code: "6206", name: "แม่ใจ" },
    { code: "6207", name: "เชียงม่วน" },
    { code: "6208", name: "ปง" },
    { code: "6209", name: "ฟากท่า" }
  ],
  55: [
    { code: "5501", name: "เมืองน่าน" },
    { code: "5502", name: "ท่าวังผา" },
    { code: "5503", name: "ปัว" },
    { code: "5504", name: "ทุ่งช้าง" },
    { code: "5505", name: "เชียงกลาง" },
    { code: "5506", name: "สันติสุข" },
    { code: "5507", name: "นาน้อย" },
    { code: "5508", name: "บ่อเกลือ" },
    { code: "5509", name: "เฉลิมพระเกียรติ" },
    { code: "5510", name: "น้ำปาด" },
    { code: "5511", name: "อำเภอศรีสัชนาลัย" },
    { code: "5512", name: "อำเภอแม่แตง" },
    { code: "5513", name: "อำเภอปัว" },
    { code: "5514", name: "อำเภอท่าวังผา" },
    { code: "5515", name: "อำเภอทุ่งช้าง" }
  ],
  64: [
    { code: "6401", name: "เมืองตาก" },
    { code: "6402", name: "แม่ระมาด" },
    { code: "6403", name: "อุ้มผาง" },
    { code: "6404", name: "สามเงา" },
    { code: "6405", name: "พบพระ" },
    { code: "6406", name: "ท่าสองยาง" },
    { code: "6407", name: "แม่สอด" },
    { code: "6408", name: "ตาก" },
    { code: "6409", name: "อุ้มผาง" }
  ],
  65: [
    { code: "6501", name: "เมืองสุโขทัย" },
    { code: "6502", name: "คีรีมาศ" },
    { code: "6503", name: "ศรีสัชนาลัย" },
    { code: "6504", name: "สวรรคโลก" },
    { code: "6505", name: "ยางสูง" },
    { code: "6506", name: "ทุ่งเสลี่ยม" },
    { code: "6507", name: "ศรีนคร" },
    { code: "6508", name: "บ้านตาก" },
    { code: "6509", name: "วังทอง" }
  ],
  77: [
    { code: "7701", name: "เมืองกำแพงเพชร" },
    { code: "7702", name: "ขาณุวรลักษบุรี" },
    { code: "7703", name: "พาณิชย์" },
    { code: "7704", name: "คลองลาน" },
    { code: "7705", name: "บึงสามัคคี" },
    { code: "7706", name: "บางลาย" },
    { code: "7707", name: "ท่าไม้" },
    { code: "7708", name: "พนมทวน" },
    { code: "7709", name: "หนองปลิง" },
    { code: "7710", name: "วังทอง" },
    { code: "7711", name: "บ้านโป่ง" }
  ],
  41: [ // อุดรธานี
    { code: "4101", name: "เมืองอุดรธานี" },
    { code: "4102", name: "หนองวัวซอ" },
    { code: "4103", name: "หนองหาน" },
    { code: "4104", name: "บ้านผือ" },
    { code: "4105", name: "บ้านดุง" },
    { code: "4106", name: "กุมภวาปี" },
    { code: "4107", name: "โนนสะอาด" },
    { code: "4108", name: "เพ็ญ" },
    { code: "4109", name: "น้ำโสม" },
    { code: "4110", name: "กุดจับ" },
    { code: "4111", name: "ศรีธาตุ" },
    { code: "4112", name: "วังสามหมอ" },
    { code: "4113", name: "ทุ่งฝน" },
    { code: "4114", name: "สร้างคอม" },
    { code: "4115", name: "ไชยวาน" },
    { code: "4116", name: "หนองแสง" },
    { code: "4117", name: "นายูง" },
    { code: "4118", name: "พิบูลย์รักษ์" },
    { code: "4119", name: "กู่แก้ว" },
    { code: "4120", name: "ประจักษ์ศิลปาคม" }
  ],
  30: [ // นครราชสีมา
    { code: "3001", name: "เมืองนครราชสีมา" },
    { code: "3002", name: "ครบุรี" },
    { code: "3003", name: "เสิงสาง" },
    { code: "3004", name: "คง" },
    { code: "3005", name: "บ้านเหลื่อม" },
    { code: "3006", name: "จักราช" },
    { code: "3007", name: "โชคชัย" },
    { code: "3008", name: "ด่านขุนทด" },
    { code: "3009", name: "โนนไทย" },
    { code: "3010", name: "โนนสูง" },
    { code: "3011", name: "ขามสะแกแสง" },
    { code: "3012", name: "บัวใหญ่" },
    { code: "3013", name: "ประทาย" },
    { code: "3014", name: "ปักธงชัย" },
    { code: "3015", name: "พิมาย" },
    { code: "3016", name: "ห้วยแถลง" },
    { code: "3017", name: "ชุมพวง" },
    { code: "3018", name: "สูงเนิน" },
    { code: "3019", name: "ขามทะเลสอ" },
    { code: "3020", name: "สีคิ้ว" },
    { code: "3021", name: "ปากช่อง" },
    { code: "3022", name: "หนองบุญมาก" },
    { code: "3023", name: "แก้งสนามนาง" },
    { code: "3024", name: "โนนแดง" },
    { code: "3025", name: "วังน้ำเขียว" },
    { code: "3026", name: "เฉลิมพระเกียรติ" },
    { code: "3027", name: "เมืองยาง" },
    { code: "3028", name: "บัวลาย" },
    { code: "3029", name: "สีดา" },
    { code: "3030", name: "เทพารักษ์" },
    { code: "3031", name: "พระทองคำ" },
    { code: "3032", name: "ลำทะเมนชัย" }
  ],
  44: [ // มหาสารคาม
    { code: "4401", name: "เมืองมหาสารคาม" },
    { code: "4402", name: "กุดรัง" },
    { code: "4403", name: "ชื่นชม" },
    { code: "4404", name: "นาดูน" },
    { code: "4405", name: "นาเชือก" },
    { code: "4406", name: "เชียงยืน" },
    { code: "4407", name: "วาปีปทุม" },
    { code: "4408", name: "แกดำ" },
    { code: "4409", name: "โกสุมพิสัย" },
    { code: "4410", name: "บรบือ" },
    { code: "4411", name: "ยางสีสุราช" },
    { code: "4412", name: "กันทรวิชัย" },
    { code: "4413", name: "พยัคฆภูมิพิสัย" }
  ],
  45: [ // ร้อยเอ็ด
    { code: "4501", name: "เมืองร้อยเอ็ด" },
    { code: "4502", name: "เกษตรวิสัย" },
    { code: "4503", name: "ปทุมรัตต์" },
    { code: "4504", name: "จตุรพักตรพิมาน" },
    { code: "4505", name: "ธวัชบุรี" },
    { code: "4506", name: "พนมไพร" },
    { code: "4507", name: "โพนทอง" },
    { code: "4508", name: "โพธิ์ชัย" },
    { code: "4509", name: "หนองพอก" },
    { code: "4510", name: "เสลภูมิ" },
    { code: "4511", name: "สุวรรณภูมิ" },
    { code: "4512", name: "เมืองสรวง" },
    { code: "4513", name: "โพนทราย" },
    { code: "4514", name: "อาจสามารถ" },
    { code: "4515", name: "เมยวดี" },
    { code: "4516", name: "ศรีสมเด็จ" },
    { code: "4517", name: "จังหาร" },
    { code: "4518", name: "เชียงขวัญ" },
    { code: "4519", name: "หนองฮี" },
    { code: "4520", name: "ทุ่งเขาหลวง" }
  ],
  47: [ // สกลนคร
    { code: "4701", name: "เมืองสกลนคร" },
    { code: "4702", name: "กุดบาก" },
    { code: "4703", name: "พรรณานิคม" },
    { code: "4704", name: "อากาศอำนวย" },
    { code: "4705", name: "บ้านม่วง" },
    { code: "4706", name: "พังโคน" },
    { code: "4707", name: "คำตากล้า" },
    { code: "4708", name: "นิคมน้ำอูน" },
    { code: "4709", name: "เต่างอย" },
    { code: "4710", name: "โคกศรีสุพรรณ" },
    { code: "4711", name: "เจริญศิลป์" },
    { code: "4712", name: "โพนนาแก้ว" },
    { code: "4713", name: "ภูพาน" }
  ],
  33: [ // ศรีสะเกษ
    { code: "3301", name: "เมืองศรีสะเกษ" },
    { code: "3302", name: "ขุนหาญ" },
    { code: "3303", name: "ยางชุมน้อย" },
    { code: "3304", name: "วังหิน" },
    { code: "3305", name: "กันทรารมย์" },
    { code: "3306", name: "กันทรลักษ์" },
    { code: "3307", name: "ขุขันธ์" },
    { code: "3308", name: "ไพรบึง" },
    { code: "3309", name: "ปรางค์กู่" },
    { code: "3310", name: "ราษีไศล" },
    { code: "3311", name: "อุทุมพรพิสัย" },
    { code: "3312", name: "บึงบูรพ์" },
    { code: "3313", name: "ห้วยทับทัน" },
    { code: "3314", name: "โนนคูณ" },
    { code: "3315", name: "ศรีรัตนะ" },
    { code: "3316", name: "น้ำเกลี้ยง" },
    { code: "3317", name: "ภูสิงห์" },
    { code: "3318", name: "เมืองจันทร์" },
    { code: "3319", name: "เบญจลักษ์" },
    { code: "3320", name: "พยุห์" },
    { code: "3321", name: "โพธิ์ศรีสุวรรณ" },
    { code: "3322", name: "ศิลาลาด" }
  ],
  32: [ // สุรินทร์
    { code: "3201", name: "เมืองสุรินทร์" },
    { code: "3202", name: "ชุมพลบุรี" },
    { code: "3203", name: "ท่าตูม" },
    { code: "3204", name: "จอมพระ" },
    { code: "3205", name: "ปราสาท" },
    { code: "3206", name: "กาบเชิง" },
    { code: "3207", name: "รัตนบุรี" },
    { code: "3208", name: "สนม" },
    { code: "3209", name: "ศีขรภูมิ" },
    { code: "3210", name: "สังขะ" },
    { code: "3211", name: "ลำดวน" },
    { code: "3212", name: "สำโรงทาบ" },
    { code: "3213", name: "บัวเชด" },
    { code: "3214", name: "พนมดงรัก" },
    { code: "3215", name: "ศรีณรงค์" },
    { code: "3216", name: "เขวาสินรินทร์" },
    { code: "3217", name: "โนนนารายณ์" }
  ],
  74: [
    { code: "7401", name: "เมืองสมุทรสาคร" },
    { code: "7402", name: "กระทุ่มแบน" },
    { code: "7403", name: "บ้านแพ้ว" }, 
  ],
  42: [
    { code: "4201", name: "เมืองเลย" },
    { code: "4202", name: "เชียงคาน" },
    { code: "4203", name: "ด่านซ้าย" },
    { code: "4204", name: "ภูเรือ" },
    { code: "4205", name: "ท่าลี่" },
    { code: "4206", name: "นาแห้ว" },
    { code: "4207", name: "ภูหลวง" },
    { code: "4208", name: "วังสะพุง" },
    { code: "4209", name: "หนองหิน" },
    { code: "4210", name: "ปากชม" },
    { code: "4211", name: "สารภี" }
  ],
  34: [
    { code: "3401", name: "เมืองอุบลราชธานี" },
    { code: "3402", name: "วารินชำราบ" },
    { code: "3403", name: "โขงเจียม" },
    { code: "3404", name: "พิบูลมังสาหาร" },
    { code: "3405", name: "กุดข้าวปุ้น" },
    { code: "3406", name: "เขมราฐ" },
    { code: "3407", name: "เขื่องใน" },
    { code: "3408", name: "เดชอุดม" },
    { code: "3409", name: "ดอนมดแดง" },
    { code: "3410", name: "ตระการพืชผล" },
    { code: "3411", name: "ตาลสุม" },
    { code: "3412", name: "ทุ่งศรีอุดม" },
    { code: "3413", name: "นาจะหลวย" },
    { code: "3414", name: "นาตาล" },
    { code: "3415", name: "นาเยีย" },
    { code: "3416", name: "น้ำขุ่น" },
    { code: "3417", name: "น้ำยืน" },
    { code: "3418", name: "บุณฑริก" },
    { code: "3419", name: "โพธิ์ไทร" },
    { code: "3420", name: "ศรีเมืองใหม่" },
    { code: "3421", name: "สว่างวีระวงศ์" },
    { code: "3422", name: "สำโรง" },
    { code: "3423", name: "สิรินธร" },
    { code: "3424", name: "เหล่าเสือโก้ก" }
  ],
  35: [
    { code: "3501", name: "เมืองยโสธร" },
    { code: "3502", name: "ค้อวัง" },
    { code: "3503", name: "คำเขื่อนแก้ว" },
    { code: "3504", name: "มหาชนะชัย" },
    { code: "3505", name: "เลิงนกทา" },
    { code: "3506", name: "ไทยเจริญ" },
    { code: "3507", name: "กุดชุม" },
    { code: "3508", name: "ทรายมูล" },
    { code: "3509", name: "ป่าติ้ว" }
  ],
  20: [
    { code: "2001", name: "เมืองชลบุรี" },
    { code: "2002", name: "บางละมุง" },
    { code: "2003", name: "พานทอง" },
    { code: "2004", name: "ศรีราชา" },
    { code: "2005", name: "พนัสนิคม" },
    { code: "2006", name: "บ้านบึง" },
    { code: "2007", name: "สัตหีบ" },
    { code: "2008", name: "หนองใหญ่" },
    { code: "2009", name: "เกาะศรีชัง" },
    { code: "2010", name: "เกาะจันทร์" }
  ],
  21: [
    { code: "2101", name: "เมืองระยอง" },
    { code: "2102", name: "บ้านค่าย" },
    { code: "2103", name: "ปลวกแดง" },
    { code: "2104", name: "เขาชะเมา" },
    { code: "2105", name: "แกลง" },
    { code: "2106", name: "บ้านฉาง" },
    { code: "2107", name: "วังจันทร์" },
    { code: "2108", name: "เขาชะเมา" }
  ],
  22: [
    { code: "2201", name: "เมืองจันทบุรี" },
    { code: "2202", name: "ท่าใหม่" },
    { code: "2203", name: "ขลุง" },
    { code: "2204", name: "สอยดาว" },
    { code: "2205", name: "มะขาม" },
    { code: "2206", name: "แหลมสิงห์" },
    { code: "2207", name: "โป่งน้ำร้อน" },
    { code: "2208", name: "นายายอาม" },
    { code: "2209", name: "เขาคิชฌกูฏ" },
    { code: "2210", name: "แก่งหางแมว" }
  ],
 23: [
    { code: "2301", name: "เมืองตราด" },
    { code: "2302", name: "คลองใหญ่" },
    { code: "2303", name: "บ่อไร่" },
    { code: "2304", name: "เขาสมิง" },
    { code: "2305", name: "แหลมงอบ" },
    { code: "2306", name: "เกาะช้าง" },
    { code: "2307", name: "เกาะกูด" }
  ],
  24: [
    { code: "2401", name: "เมืองฉะเชิงเทรา" },
    { code: "2402", name: "บางคล้า" },
    { code: "2403", name: "พนมสารคาม" },
    { code: "2404", name: "แปลงยาว" },
    { code: "2405", name: "บางปะกง" },
    { code: "2406", name: "บ้านโพธิ์" },
    { code: "2407", name: "บางน้ำเปรี้ยว" },
    { code: "2408", name: "สนามชัยเขต" },
    { code: "2409", name: "ราชสาส์น" },
    { code: "2410", name: "ท่าตะเกียบ" },
    { code: "2411", name: "คลองเขื่อง" }
  ],
  27: [
    { code: "2701", name: "เมืองสระแก้ว" },
    { code: "2702", name: "เขาฉกรรจ์" },
    { code: "2703", name: "คลองหาด" },
    { code: "2704", name: "วัฒนานคร" },
    { code: "2705", name: "ตาพระยา" },
    { code: "2706", name: "วังน้ำเย็น" },
    { code: "2707", name: "อรัญประเทศ" },
    { code: "2708", name: "โคกสูง" },
    { code: "2709", name: "วังสมบูรณ์" }
  ],
  86: [
    { code: "8601", name: "เมืองชุมพร" },
    { code: "8602", name: "ท่าแซะ" },
    { code: "8603", name: "หลังสวน" },
    { code: "8604", name: "ละแม" },
    { code: "8605", name: "ปะทิว" },
    { code: "8606", name: "พะโต๊ะ" },
    { code: "8607", name: "ทุ่งตะโก" },
    { code: "8608", name: "สวี" }
  ],
 85: [
    { code: "8501", name: "เมืองระนอง" },
    { code: "8502", name: "กระบุรี" },
    { code: "8503", name: "สาธิต" },
    { code: "8504", name: "กะเปอร์" },
    { code: "8505", name: "ละอุ่น" },
    { code: "8506", name: "สุขสำราญ" }
  ],
  84: [
    { code: "8401", name: "เมืองสุราษฎร์ธานี" },
    { code: "8402", name: "กาญจนดิษฐ์" },
    { code: "8403", name: "ดอนสัก" },
    { code: "8404", name: "บ้านนา" },
    { code: "8405", name: "เกาะสมุย" },
    { code: "8406", name: "เกาะพะงัน" },
    { code: "8407", name: "ไชยา" },
    { code: "8408", name: "ท่าชนะ" },
    { code: "8409", name: "คีรีรัฐนิคม" },
    { code: "8410", name: "บ้านตาขุน" },
    { code: "8411", name: "พนม" },
    { code: "8412", name: "ท่าฉาง" },
    { code: "8413", name: "บ้านนาสาร" },
    { code: "8414", name: "บ้านนาเดิม" },
    { code: "8415", name: "เคียนซา" },
    { code: "8416", name: "เวียงสระ" },
    { code: "8417", name: "พระแสง" },
    { code: "8418", name: "พุนพิน" },
    { code: "8419", name: "ชัยบุรี" },
    { code: "8420", name: "วิภาวดี" }
  ],
  80: [
    { code: "8001", name: "เมืองนครศรีธรรมราช" },
    { code: "8002", name: "พิปูน" },
    { code: "8003", name: "ทุ่งสง" },
    { code: "8004", name: "ขนอม" },
    { code: "8005", name: "พรหมคีรี" },
    { code: "8006", name: "ลานสกา" },
    { code: "8007", name: "ฉวาง" },
    { code: "8008", name: "เชียรใหญ่" },
    { code: "8009", name: "ชะอวด" },
    { code: "8010", name: "ท่าศาลา" },
    { code: "8011", name: "นาบอน" },
    { code: "8012", name: "ทุ่งใหญ่" },
    { code: "8013", name: "ปากพนัง" },
    { code: "8014", name: "ร่อนพิบูลย์" },
    { code: "8015", name: "สิชล" },
    { code: "8016", name: "หัวไทร" },
    { code: "8017", name: "บางขัน" },
    { code: "8018", name: "ถ้ำพรรณรา" },
    { code: "8019", name: "จุฬาภรณ์" },
    { code: "8020", name: "พระพรหม" },
    { code: "8021", name: "นบพิตำ" },
    { code: "8022", name: "ช้างกลาง" },
    { code: "8023", name: "เฉลิมพระเกียรติ" }
  ],
  81: [
    { code: "8101", name: "เมืองกระบี่" },
    { code: "8102", name: "ลำทับ" },
    { code: "8103", name: "คลองท่อม" },
    { code: "8104", name: "อ่าวลึก" },
    { code: "8105", name: "เขาพนม" },
    { code: "8106", name: "เกาะลันตา" },
    { code: "8107", name: "ปลายพระยา" },
    { code: "8108", name: "เหนือคลอง" }
  ],
  82: [
    { code: "8201", name: "เมืองพังงา" },
    { code: "8202", name: "คุระบุรี" },
    { code: "8203", name: "ตะกั่วป่า" },
    { code: "8204", name: "ทับปุด" },
    { code: "8205", name: "เกาะยาว" },
    { code: "8206", name: "กะปง" },
    { code: "8207", name: "ตะกั่วทุ่ง" },
    { code: "8208", name: "ท้ายเหมือง" }
  ],
  83: [
    { code: "8301", name: "เมืองภูเก็ต" },
    { code: "8302", name: "ถลาง" },
    { code: "8303", name: "กะทู้" }
  ],
  92: [
    { code: "9201", name: "เมืองตรัง" },
    { code: "9202", name: "ห้วยยอด" },
    { code: "9203", name: "ย่านตาขาว" },
    { code: "9204", name: "วังวิเศษ" },
    { code: "9205", name: "กันตัง" },
    { code: "9206", name: "ปะเหลียน" },
    { code: "9207", name: "สิเกา" },
    { code: "9208", name: "นาโยง" },
    { code: "9209", name: "รัษฎา" },
    { code: "9210", name: "หาดสำราญ" }
  ],
  91: [
    // สตูล
    { code: "9101", name: "เมืองสตูล" },
    { code: "9102", name: "ละงู" },
    { code: "9103", name: "ทุ่งหว้า" },
  ],
  94: [
    { code: "9401", name: "เมืองปัตตานี" },
    { code: "9402", name: "ไม้แก่น" },
    { code: "9403", name: "หนองจิก" },
    { code: "9404", name: "ทุ่งยางแดง" },
    { code: "9405", name: "กะพ้อ" },
    { code: "9406", name: "โคกโพธิ์" },
    { code: "9407", name: "ปะนาเระ" },
    { code: "9408", name: "แม่ลาน" },
    { code: "9409", name: "มายอ" },
    { code: "9410", name: "ยะรัง" },
    { code: "9411", name: "ยะหริ่ง" },
    { code: "9412", name: "สายบุรี" }
  ],
  56: [
    { code: "5601", name: "อำเภอเมืองพะเยา" },
    { code: "5602", name: "อำเภอจุน" },
    { code: "5603", name: "อำเภอเชียงคำ" },
    { code: "5604", name: "อำเภอเชียงม่วน" },
    { code: "5605", name: "อำเภอดอกคำใต้" },
    { code: "5606", name: "อำเภอปง" },
    { code: "5607", name: "อำเภอแม่ใจ" },
    { code: "5608", name: "อำเภอภูซาง" },
    { code: "5609", name: "อำเภอภูกามยาว" }
  ],
  95: [
    { code: "9501", name: "เมืองยะลา" },
    { code: "9502", name: "กรงปินัง" },
    { code: "9503", name: "เบตง" },
    { code: "9504", name: "บันนังสตา" },
    { code: "9505", name: "ยะหา" },
    { code: "9506", name: "รามัน" },
    { code: "9507", name: "ธารโต" },
    { code: "9508", name: "กาบัง" }
  ],
  96: [
    { code: "9601", name: "เมืองนราธิวาส" },
    { code: "9602", name: "สุไหงโกลก" },
    { code: "9603", name: "ระแงะ" },
    { code: "9604", name: "จะแนะ" },
    { code: "9605", name: "ตากใบ" },
    { code: "9606", name: "บาเจาะ" },
    { code: "9607", name: "ยี่งอ" },
    { code: "9608", name: "รือเสาะ" },
    { code: "9609", name: "ศรีสาคร" },
    { code: "9610", name: "แว้ง" },
    { code: "9611", name: "สุคิริน" },
    { code: "9612", name: "สุไหงปาดี" },
    { code: "9613", name: "เจาะไอร้อง" }
  ],
  90: [
    { code: "9001", name: "เมืองสงขลา" },
    { code: "9002", name: "หาดใหญ่" },
    { code: "9003", name: "บางกล่ำ" },
    { code: "9004", name: "ควนเนียง" },
    { code: "9005", name: "ระโนด" },
    { code: "9006", name: "กระแสสินธุ์" },
    { code: "9007", name: "สทิงพระ" },
    { code: "9008", name: "สิงหนคร" },
    { code: "9009", name: "รัตภูมิ" },
    { code: "9010", name: "นาหม่อม" },
    { code: "9011", name: "จะนะ" },
    { code: "9012", name: "เทพา" },
    { code: "9013", name: "นาทวี" },
    { code: "9014", name: "สะบ้าย้อย" },
    { code: "9015", name: "สะเดา" },
    { code: "9016", name: "คลองหอยโข่ง" }
  ],
  93: [
    { code: "9301", name: "เมืองพัทลุง" },
    { code: "9302", name: "ควนขนุน" },
    { code: "9303", name: "ศรีนครินทร์" },
    { code: "9304", name: "ปากพะยูน" },
    { code: "9305", name: "บางแก้ว" },
    { code: "9306", name: "ป่าพะยอม" },
    { code: "9307", name: "ศรีบรรพต" },
    { code: "9308", name: "ป่าบอน" },
    { code: "9309", name: "ตะโหมด" },
    { code: "9310", name: "กงหรา" },
    { code: "9311", name: "เขาชัยสน" }
  ],
};

const filteredDistricts = computed(() => {
  // ตรวจสอบว่ามีการเลือกจังหวัดหรือไม่
  if (!selectedProvince.value) return [];

  // ดึงข้อมูลอำเภอจาก districts โดยตรง (ไม่ต้องใช้ .value เพราะ districts เป็น object ธรรมดา)
  const provinceDistricts = districts[selectedProvince.value];
  return Array.isArray(provinceDistricts) ? provinceDistricts : [];
});

const roles = ref(props.roles || []);
  
  const submit = () => {
    form.name = userData.value.name;
    form.email = userData.value.email;
    form.id_card = userData.value.id_card;
    form.phone = userData.value.phone;
    form.birthday = formatBirthday(userData.value.birthday); // ให้แน่ใจว่า format ถูกต้อง
    form.title = userData.value.title;
    form.fname = userData.value.fname;
    form.lname = userData.value.lname;
    form.zip_code = userData.value.zip_code;
    form.student_code = userData.value.student_code;
    form.institution = userData.value.institution;
    form.branch = userData.value.branch;
    form.faculty = userData.value.faculty;
    form.sub_district = userData.value.sub_district;
    form.district = userData.value.district;
    form.province = userData.value.province;

    form.put(route("users.update", props.user.id), {
      onSuccess: () => {
        console.debug("✅ อัปเดตสำเร็จ!", form);
        Swal.fire({
          title: "อัปเดตสำเร็จ!",
          text: "ข้อมูลผู้ใช้ถูกอัปเดตเรียบร้อย",
          icon: "success",
          confirmButtonText: "ตกลง",
          confirmButtonColor: "#3085d6",
        });
      },
      onError: (errors) => {
        console.error("❌ อัปเดตล้มเหลว:", errors);
        Swal.fire({
          title: "เกิดข้อผิดพลาด!",
          text: "ไม่สามารถอัปเดตข้อมูลได้",
          icon: "error",
          confirmButtonText: "ลองอีกครั้ง",
        });
      },
    });
  };
function formatBirthday(birthday) {
  return birthday ? moment(birthday).format('YYYY-MM-DD') : '';
}

watch(formattedBirthday, (newValue) => {
  userData.value.birthday = moment(newValue).toISOString(); // อัปเดต userData.birthday
});
watch(
  () => props.roles,
  (newRoles) => {
    roles.value = newRoles || []; // ใช้ค่าใหม่ที่รับมา ถ้าเป็น null หรือ undefined ให้ใช้ array ว่าง
  }
);
</script>

<template>
  <AuthenticatedLayout>

    <Head title="Update User" />

    <div class="max-w-7xl mx-auto py-4 mt-20 px-10">
      <div class="px-4 text-white dark:text-gray-100 flex justify-between items-center">
        <div class="py-2 text-gray-800 rounded-t-lg text-xl font-bold">กำหนดหน้าที่</div>
        <div class="flex-1 mr-3 ml-3">
          <hr class="border-t border-gray-300" />
        </div>
        <div class="flex justify-end space-x-4">
          <Link :href="route('users.index')" class="custom-button-danger"> กลับ </Link>
          <button class="custom-button-success" :class="{ 'opacity-25': form.processing }" :disabled="form.processing"
            @click="submit">
            บันทึก
          </button>
        </div>
      </div>
    </div>

    <div class="max-w-6xl mx-auto mt-6 px-12">
      <form @submit.prevent="submit">
        <div class="grid grid-cols-1 sm:grid-cols-2 lg:grid-cols-3 gap-6">
          <!-- <pre>{{roles}}</pre>
          <pre>{{ user }}</pre> -->
          <EditScholar :user="user" :roles="roles" />
          <div>
            <InputLabel for="name" value="Name" />
            <TextInput id="name" type="text" class="mt-1 block w-full" v-model="userData.name" required autofocus />
            <InputError class="mt-2" :message="form.errors.name" />
          </div>
          <div>
            <InputLabel for="email" value="Email" />
            <TextInput id="email" type="email" class="mt-1 block w-full bg-gray-200 text-gray-500 cursor-not-allowed"
              v-model="userData.email" required disabled />
            <InputError class="mt-2" :message="form.errors.email" />
          </div>

          <div>
            <InputLabel for="title" value="Title" />
            <select id="title" v-model="userData.title"
              class="mt-1 block w-full border border-gray-600 text-gray-900 rounded-lg p-2">
              <option value="0">นาย</option>
              <option value="1">นาง</option>
              <option value="2">นางสาว</option>
            </select>
            <InputError class="mt-2" :message="form.errors.title" />
          </div>

          <div>
            <InputLabel for="fname" value="First Name" />
            <TextInput id="fname" type="text" class="mt-1 block w-full" v-model="userData.fname" />
            <InputError class="mt-2" :message="form.errors.fname" />
          </div>

          <div>
            <InputLabel for="lname" value="Last Name" />
            <TextInput id="lname" type="text" class="mt-1 block w-full" v-model="userData.lname" />
            <InputError class="mt-2" :message="form.errors.lname" />
          </div>

          <div>
            <InputLabel for="phone" value="Phone" />
            <TextInput id="phone" type="text" class="mt-1 block w-full" v-model="userData.phone" />
            <InputError class="mt-2" :message="form.errors.phone" />
          </div>

          <div>

            <InputLabel for="birthday" value="Birthday" />
            <TextInput id="birthday" type="date" class="mt-1 block w-full" v-model="formattedBirthday" />
            <InputError class="mt-2" :message="form.errors.birthday" />
          </div>

          <div>
            <InputLabel for="student_code" value="Student Code" />
            <TextInput id="student_code" type="text" class="mt-1 block w-full" v-model="userData.student_code" />
            <InputError class="mt-2" :message="form.errors.student_code" />
          </div>

          <div>
            <InputLabel for="id_card" value="ID Card" />
            <TextInput id="id_card" type="text" class="mt-1 block w-full" v-model="userData.id_card" />
            <InputError class="mt-2" :message="form.errors.id_card" />
          </div>

          <div>
            <InputLabel for="house_no" value="บ้านเลขที่" />
            <TextInput id="house_no" type="text" class="mt-1 block w-full" v-model="userData.house_no" />
            <InputError class="mt-2" :message="form.errors.house_no" />
          </div>

          <div>
            <InputLabel for="village_name" value="ชื่อหมู่บ้าน" />
            <TextInput id="village_name" type="text" class="mt-1 block w-full" v-model="userData.village_name" />
            <InputError class="mt-2" :message="form.errors.village_name" />
          </div>
          <div>
            <InputLabel for="sub_district" value="ตำบล" />
            <TextInput id="sub_district" type="text" class="mt-1 block w-full" v-model="userData.sub_district" />
            <InputError class="mt-2" :message="form.errors.sub_district" />
          </div>
          <div>
            <label>เลือกจังหวัด:</label>
            <select v-model="selectedProvince"
              class="mt-1 block w-full border border-gray-600 text-gray-900 rounded-lg p-2">
              <option :value="null" disabled>-- เลือกจังหวัด --</option>
              <option v-for="province in provinces" :key="province.code" :value="province.code">
                {{ province.name }}
              </option>
            </select>
          </div>
          <div>
            <!-- เลือกอำเภอ -->
            <label>เลือกอำเภอ:</label>
            <select v-model="selectedDistrict"
              class="mt-1 block w-full border border-gray-600 text-gray-900 rounded-lg p-2"
              :disabled="!selectedProvince">
              <option :value="null" disabled>-- เลือกอำเภอ --</option>
              <option v-for="district in filteredDistricts" :key="district.name" :value="district.name">
                {{ district.name }}
              </option>
            </select>
          </div>
        </div>

        <div class="flex justify-end mt-6">
          <button class="custom-button-success" :class="{ 'opacity-25': form.processing }" :disabled="form.processing"
            @click="submit">
            บันทึก
          </button>
        </div>
      </form>
    </div>
  </AuthenticatedLayout>
</template>

<style src="vue-multiselect/dist/vue-multiselect.css"></style>
